<template>
    <section class="container-fluid">
        <header>
            <h1>
                Оригінальні аксесуари Toyota
                <h2>Додаткове обладнання, що створює індивідуальність</h2>
            </h1>
        </header>

        <div class="body container">
            <h2>Оригінальні аксесуари Toyota допоможуть вам отримувати нові враження від кожної поїздки на своєму автомобілі. Завдяки чималому асортименту додаткового обладнання виробництва компанії «Тойота» ви з легкістю зможете додати індивідуальності своєму автомобілю, зробити його ще більш практичним.</h2>


        </div>
    </section>
</template>

<script>
    export default {
        name: "ToyotaProTect"
    }
</script>

<style scoped>

</style>