<template>
    <main>
        <menu-ecology></menu-ecology>
        <header></header>
        <div v-html="pageBody"></div>

<!--        <div class="body container text-left">-->
<!--            <h5>Виклики Toyota щодо навколишнього середовища до 2050 року, оголошені 2015 року, містять шість позицій, які охоплюють усі аспекти нашого бізнесу, процес дослідження нових продуктів та технологій, а також стосуються нашої функції зі сприяння вивчення та вдосконалення навколишнього природного світу людьми та громадами.</h5>-->

<!--            <article>-->
<!--                <header>-->
<!--                    <h1>Виклик 1</h1>-->
<!--                    <div class="row">-->
<!--                        <div class="col-md-6 col-12">-->
<!--                            <h4>Зведення викидів CO2 від автомобілів до 0, шляхом виробництва автомобілів нового покоління</h4>-->
<!--                            <p>Завдання виклику щодо зведення викидів CO2 від автомобілів до 0, шляхом виробництва автомобілів нового покоління - зменшити викиди CO2 нашими транспортними засобами на 90% до 2050 року у порівнянні з 2010 роком.</p>-->
<!--                            <p>Аби домогтися цього Toyota перетворює традиційні моделі на більш економічно ефективні, і сприяє розвитку транспортних засобів наступного покоління з низьким чи нульовим викидом СО2, у тому числі гібридів і гібридів з силовою установкою, електрокарів та авто на водневих паливних елементах.</p>-->
<!--                            <p>Автомобілі на більш чистих, альтернативних видах палива, можуть покращити екологічну ситуацію лише тоді, коли їх буде багато у вжитку, тож Toyota працює, аби зробити ці засоби доступними для широкого кола користувачів та стимулювати розвиток інфраструктури - зокрема, мереж заправних станцій та пунктів підзарядки.</p>-->
<!--                        </div>-->
<!--                        -->
<!--                        <div class="col-md-6 col-12">-->
<!--                            <img src="//t1-cms-2.images.toyota-europe.com/toyotaone/uaua/vikliki-2050-1_tcm-3046-617991.jpg" alt="Виклик 1">-->
<!--                        </div>-->
<!--                    </div>-->
<!--                </header>-->
<!--            </article>-->

<!--            <article>-->
<!--                <header>-->
<!--                    <h1>Виклик 2</h1>-->
<!--                    <div class="row">-->
<!--                        <div class="col-md-6 col-12">-->
<!--                            <h4>Зведення викидів CO2 до 0, протягом всього «життєвого циклу» автомобіля</h4>-->
<!--                            <p>Стосовно виклику щодо зведення викидів CO2 до 0, протягом всього «життєвого циклу» автомобіляToyota прагне зробити більше, ніж просто усунути викиди у процесі виготовлення та експлуатації транспортних засобів</p>-->
<!--                            <p>Toyota прагне виключити викиди вуглецю у процесі виготовлення матеріалів та деталей, які використовуються, а також від логістичної діяльності та протягом утилізації і переробки автомобілів.</p>-->
<!--                            <p>Для цього Toyota має намір розробити нові проекти автомобілів, для яких потрібна сировина з меншим вмістом вуглецю та менша кількість деталей. Toyota буде ширше використовувати біоматеріали з відновлюваних джерел, що полегшить демонтаж та переробку машин.</p>-->
<!--                        </div>-->

<!--                        <div class="col-md-6 col-12">-->
<!--                            <img src="//t1-cms-4.images.toyota-europe.com/toyotaone/uaua/vikliki-2050-2_tcm-3046-617992.jpg" alt="Виклик 2">-->
<!--                        </div>-->
<!--                    </div>-->
<!--                </header>-->
<!--            </article>-->

<!--            <article>-->
<!--                <header>-->
<!--                    <h1>Виклик 3</h1>-->
<!--                    <div class="row">-->
<!--                        <div class="col-md-6 col-12">-->
<!--                            <h4>Зведення викидів CO2  до 0, під час виробництва автомобілів</h4>-->
<!--                            <p>Автомобілі спричиняють викиди CO2 не лише тоді, коли ви керуєте ними, шкідливі речовини потрапляють у повітря ще й у процесі їхнього виробництва</p>-->
<!--                            <p>Аби допомогти стримати зміну клімату, Toyota реалізує стратегію зведення викидів СО2 до 0 під час виробництва автомобілів на заводах, зосередивши увагу на вдосконаленні технологій та переході на альтернативні джерела енергії.</p>-->
<!--                            <p>Toyota постійно проводить оптимізацію виробничих процесів, скорочуючи їх, аби утворювати менше CO2. Toyota робить наші автомобілі більш енергоефективними та облаштовує їх відновлюваними джерелами енергії, такі як сонячна енергія та вітер, а також низьковуглецевими енергоджерелами, такі як воднева енергія.</p>-->
<!--                        </div>-->

<!--                        <div class="col-md-6 col-12">-->
<!--                            <img src="//t1-cms-4.images.toyota-europe.com/toyotaone/uaua/vikliki-2050-3_tcm-3046-617993.jpg" alt="Виклик 3">-->
<!--                        </div>-->
<!--                    </div>-->
<!--                </header>-->
<!--            </article>-->

<!--            <article>-->
<!--                <header>-->
<!--                    <h1>Виклик 4</h1>-->
<!--                    <div class="row">-->
<!--                        <div class="col-md-6 col-12">-->
<!--                            <h4>Мінімізація та оптимізація використання водних ресурсів</h4>-->
<!--                            <p>Світові потреби у водних ресурсах швидко зростають, тому життєво необхідно зменшувати їхні витрати у процесі виробництва продуктів, а використаний ресурс максимально переробляти.</p>-->
<!--                            <p>Toyota починає збирати дощову воду на своїх виробничих майданчиках, щоб скоротити споживання підземних вод. Всі способи очищення води, дають можливість використати її повторно або безпечно повернути у місцеву мережу постачання.</p>-->
<!--                            <p>Оскільки водне середовище значно відрізняється в залежності від регіону, де ми працюємо, наші заходи відповідають місцевій специфіці і потребам.</p>-->
<!--                        </div>-->

<!--                        <div class="col-md-6 col-12">-->
<!--                            <img src="//t1-cms-2.images.toyota-europe.com/toyotaone/uaua/vikliki-2050-4_tcm-3046-617994.jpg" alt="Виклик 4">-->
<!--                        </div>-->
<!--                    </div>-->
<!--                </header>-->
<!--            </article>-->

<!--            <article>-->
<!--                <header>-->
<!--                    <h1>Виклик 5</h1>-->
<!--                    <div class="row">-->
<!--                        <div class="col-md-6 col-12">-->
<!--                            <h4>Створення системи та культури вторинної переробки ресурсів</h4>-->
<!--                            <p>Збільшення населення на планеті, ріст економіки та прагнення людства до більшого комфорту у повсякденному житті призводять до зростання споживання природних ресурсів та збільшення відходів.</p>-->
<!--                            <p>Toyota прагне допомогти розвиткові культури вторинної переробки ресурсів, працюючи в чотирьох ключових напрямках: ширше застосування екологічно чистих матеріалів; проектування та використання більш довговічних деталей; розробка більш ефективних та довершених технологій переробки; і використання максимуму матеріалів, отриманих після утилізації автомобіля, для створення нових авто.</p>-->
<!--                            <p>Toyota має більш ніж 40-річний досвід генерування ідей та впровадження інновацій у цій галузі і прагне досягти ще кращих результатів у майбутньому.</p>-->
<!--                        </div>-->

<!--                        <div class="col-md-6 col-12">-->
<!--                            <img src="//t1-cms-4.images.toyota-europe.com/toyotaone/uaua/vikliki-2050-5_tcm-3046-617995.jpg" alt="Виклик 5">-->
<!--                        </div>-->
<!--                    </div>-->
<!--                </header>-->
<!--            </article>-->

<!--            <article>-->
<!--                <header>-->
<!--                    <h1>Виклик 6</h1>-->
<!--                    <div class="row">-->
<!--                        <div class="col-md-6 col-12">-->
<!--                            <h4>Життя в гармонії з природою</h4>-->
<!--                            <p>Щоб зберегти та покращити своє співіснування з природою, нам потрібно охороняти наші ліси та інші багаті екосистеми.</p>-->
<!--                            <p>Toyota здійснює проекти - великі та малі - у всьому світі на всіх рівнях для досягнення мети зі збагачення життя громад, організовуючи відновлення лісів і висадку дерев, створюючи зелені масиви у містах та реалізуючи інші екологічні ініціативи на своїх власних майданчиках й поза ними.</p>-->
<!--                            <p>Toyota буде використовувати напрацьовані знання для активної участі у покращенні екологічної освіти та підвищенні обізнаності громадськості, аби допомогти побудувати суспільство, в якому люди живуть у гармонії зі світом природи.</p>-->
<!--                        </div>-->

<!--                        <div class="col-md-6 col-12">-->
<!--                            <img src="//t1-cms-2.images.toyota-europe.com/toyotaone/uaua/vikliki-2050-6_tcm-3046-617996.jpg" alt="Виклик 6">-->
<!--                        </div>-->
<!--                    </div>-->
<!--                </header>-->
<!--            </article>-->
<!--        </div>-->
    </main>
</template>

<script>
    import PageBody from "../../../mixins/mixinPages"
    import MenuEcology from "./../../../components/whyToyota/ecology/MenuEcology";

    export default {
        name: "EnvironmentalMission",

        components: {
            MenuEcology,
        },

        mixins: [
            PageBody
        ],

        data() {
            return {
                id: 45,
            }
        },

        metaInfo() {
            return {
                // title:  `Toyota | Виклики щодо навколишнього середовища 2050`,
                title: `Toyota Nikolaev | ${this.pageTitle}`,
                meta: [
                    {
                        vmid: "title",
                        property: "og:title",
                        // content: `Toyota | Виклики щодо навколишнього середовища 2050`
                        content: `Toyota Nikolaev | ${this.pageTitle}`
                    },
                    {
                        vmid: "description",
                        name: "description",
                        // content: `Toyota розробила пакет амбітних завдань, над виконанням яких буде працювати до 2050 року, для дотримання правила нульового впливу на довкілля.`
                        content: this.meta_description,
                    },
                    {
                        vmid: "description",
                        property: "og:description",
                        // content: `Toyota розробила пакет амбітних завдань, над виконанням яких буде працювати до 2050 року, для дотримання правила нульового впливу на довкілля.`
                        content: this.meta_description,
                    },
                    {
                        vmid: "keywords",
                        name: "keywords",
                        // content: `toyota, екологія, турбота, гібрид, автомобілі, захист, зелені технології, тойота, тайота, Enviroment, Social projects`
                        content: this.meta_keywords,
                    },
                    {
                        vmid: "keywords",
                        property: "og:keywords",
                        // content: `toyota, екологія, турбота, гібрид, автомобілі, захист, зелені технології, тойота, тайота, Enviroment, Social projects`
                        content: this.meta_keywords,
                    },
                ],
            }
        },

        // mounted() {
        //     setTimeout(() => {this.$store.commit("setShowPreload", false);}, 1500)
        // },
    }
</script>

<style lang="scss" scoped>
    @import '../../../styles/variables';

    main {
        header {
            @include header-xl;
            background-image: url(//t1-cms-4.images.toyota-europe.com/toyotaone/uaua/new_banner_EC_tcm-3046-617990.jpg);

        }
    }
    
    main ::v-deep div {
        .body.container {
            margin: 68px auto;
            color: $font_color;
            h5 {
                font-size: 2rem;
                line-height: 3rem;
                margin-bottom: 68px;
            }

            article {
                margin: 68px 0;
                height: auto;
                header {
                    background: none;
                    padding: 0;
                    height: auto;
                    h1 {
                        font-size: 4.5rem;
                        font-weight: bold;
                        margin-bottom: 40px;
                    }
                }
                .row {
                    div {
                        h4 {
                            font-size: 1.6rem;
                            font-weight: bold;
                            margin-bottom: 30px;
                        }
                        .p {
                            font-size: 1.4rem;
                            color: #595D60;
                            margin-bottom: 24px;
                        }
                        img {
                            width: 100%;
                        }
                    }

                }
            }

        }
    }

    @media (min-width: 992px) and (max-width: 1199.9px) {
        main {
            header {
                @include header-lg;
            }
        }
    }

    @media (min-width: 768px) and (max-width: 991.9px) {
        main {
            header {
                @include header-md;
            }
        }

        main ::v-deep div {
            .body.container {
                article {
                    margin: 30px 0;
                    header {
                       max-height: 100%;
                        h1 {
                            font-size: 3.5rem;
                            margin-bottom: 20px;
                        }
                    }
                    .row {
                        div {
                            h4 {
                                font-size: 1.6rem;
                                margin-bottom: 20px;
                            }
                        }
                    }
                }

            }
        }
    }

    @media (min-width: 576px) and (max-width: 767.9px) {
        main {
            header {
                @include header-sm;
            }
        }

        main ::v-deep div {
            .body.container {
                margin: 30px auto;
                h5 {
                    margin-bottom: 30px;
                }

                article {
                    margin: 30px 0;
                    header {
                        h1 {
                            font-size: 3rem;
                            margin-bottom: 15px;
                        }
                    }
                    .row {
                        div {
                            h4 {
                                font-size: 1.6rem;
                                margin-bottom: 20px;
                            }
                        }

                    }
                }

            }
        }
    }

    @media (max-width: 575.9px) {
        main {
            header {
                @include header-xs;
            }
        }

        main ::v-deep div {
            .body.container {
                margin: 30px auto;
                h5 {
                    font-size: 1.8rem;
                    line-height: 2.5rem;
                    margin-bottom: 30px;
                }

                article {
                    margin: 30px 0;
                    header {
                        h1 {
                            font-size: 3rem;
                            margin-bottom: 10px;
                        }
                    }
                    .row {
                        div {
                            h4 {
                                margin-bottom: 15px;
                            }
                            .p {
                                margin-bottom: 15px;
                            }
                        }

                    }
                }

            }
        }
    }

</style>