<template>
    <main>
        <menu-ecology></menu-ecology>
        <header>
            <h1 class="container">ПІІ "Тойота-Україна"
                <h2>Сертифіковано за стандартом ISO 14001:2015</h2>
            </h1>
        </header>
        
        <div class="body container text-left">
            <h3>Що таке ISO 14001?</h3>
            <p>Міжнародна організація зі стандартизації надає сертифікат, що визнається у всьому світі, підприємствам та організаціям, які відповідають належним стандартам з управління навколишнім середовищем. Він називається ISO 14001 і охоплює низку аспектів, включаючи впровадження екологічної політики, встановлення мети та цілей, систему навчання та інформування, а також регулярну оцінку результатів роботи.</p>
            <h4>Історія виникнення міжнародного стандарту ISO 14001</h4>
            <p>Виникнення стандартів на системи екологічного менеджменту стало відповіддю на зростаючий в суспільстві інтерес до проблем навколишнього середовища. Витоки цього інтересу можна простежити в 1972 році, коли Організація Об'єднаних Націй організувала конференцію з проблем навколишнього середовища в Стокгольмі, на якій була запущена Програма ООН з навколишнього середовища. Ці ініціативи привели до створення Всесвітньої комісії з навколишнього середовища і розвитку і прийняття Монреальського протоколу і Базельської конвенції.</p>
            <p>У 1992 році була проведена перша конференція в Ріо-де-Жанейро під назвою Саміт Землі, завданням якої було створення в суспільстві орієнтації на збереження навколишнього середовища на глобальному рівні. Під час конференції була прийнятий Порядок денний на XXI століття, метою якого є досягнення сталого розвитку, тобто високої якості навколишнього середовища і здорової економіки для всіх народів світу.</p>
            <p>Однак досягнення зазначеної мети можливе лише при скоординованої діяльності різних учасників суспільного життя. Як було відзначено підрозділом ООН з питань Сталого розвитку, промисловість відіграє ключову роль в досягненні цілей сталого розвитку в якості постачальника товарів і послуг для суспільства, як джерело створення робочих місць і як активний учасник в общинного життя.</p>
            <p>Однак досягнення зазначеної мети можливе лише при скоординованої діяльності різних учасників суспільного життя. Як було відзначено підрозділом ООН з питань Сталого розвитку, промисловість відіграє ключову роль в досягненні цілей сталого розвитку в якості постачальника товарів і послуг для суспільства, як джерело створення робочих місць і як активний учасник в общинного життя.</p>
            <p>У 1992 році BSI Group був опублікований перший в світі стандарт на системи екологічного менеджменту. Примітно, що цей стандарт з'явився не як результат діяльності держави, а з ініціативи англійських промисловців, що зіткнулися з жорсткістю природоохоронного законодавства і необхідністю застосування адекватних управлінських рішень. Цей стандарт став основою для розвитку міжнародної серії стандартів ISO 14000, опублікованій в 1996 році Міжнародною організацією зі стандартизації ISO.</p>
            <h2>ISO 14001 в ПІІ «Тойота-Україна»</h2>
                    <div class="row">
                        <div class="col-md-6 col-12">
                            <p>Ми цінуємо сертифікат ISO 14001 та запропоновані ним інструменти, які допомагають на шляху до постійного вдосконалення екологічної діяльності.  Починаючи з 2013 року ПІІ «Тойота -Україна» щорічно проходить сертифікацію згідно міжнародного стандарту ISO 14001 Система екологічного менеджменту.</p>
                            <p>У 2016 році ПІІ «Тойота-Україна» стає першою автомобільною компанією в Україні, та однією з перших в цілому, хто успішно проходить сертифікацію відповідно нової версії міжнародного стандарту ISO 14001:2015.  Цей стандарт допомагає нам розробляти та проводити заходи по створенню еко-культури як у наших співробітників, так і у мешканців нашого міста. Все це ми робимо з однією глобальною метою – життя в гармонії з природою!</p>
                        </div>
                        <div class="col-md-6 col-12">
                            <h4 class="d-flex">
                                <span class="flex-grow-1">Файли для завантаження</span>
                                <i class="fas fa-download"></i>
                            </h4>
                            <a href="https://www.toyota.ua/download/cms/uaua/toyota-ukraine-iso-certicate_tcm-3046-1427390.pdf" download>
                                <i class="far fa-file"></i>
                                <span>Сертифікат стандарту ISO 14001:2015 (pdf)</span>
                            </a>
                        </div>
                    </div>


        </div>
    </main>
</template>

<script>
    import MenuEcology from "./../../../components/whyToyota/ecology/MenuEcology";

    export default {
        name: "ISO",

        components: {
            MenuEcology,
        },
    }
</script>

<style lang="scss" scoped>
    @import '../../../styles/variables';

    main {
        header {
            @include header-xl;
            background-image: url(//t1-cms-3.images.toyota-europe.com/toyotaone/uaua/iso-14001_tcm-3046-1427379.jpg);
        }

        .body.container {
            margin: 68px auto;
            color: $font_color;
            h3 {
                font-size: 3.4rem;
                margin-bottom: 68px;
                text-align: center;
                /*font-weight: bold;*/
            }
            p {
                font-size: 1.4rem;
                color: #595D60;
                margin-bottom: 30px;
            }
            h4 {
                font-size: 1.5rem;
                font-weight: bold;
                margin-bottom: 30px;
            }
            h2 {
                font-size: 4.4rem;
                font-weight: bold;
                margin-bottom: 30px;
                padding: 0 15px;
            }

            .row {
                div {
                    h4 {
                        i.fa-download {
                            color: #E50000;
                        }
                        padding-bottom: 16px;
                        border-bottom: 1px solid #CCCCCC;
                        margin-bottom: 15px;
                    }

                    a {
                        color: #595D60;
                        font-size: 1.5rem;
                        i.fa-file {
                            display: inline-block;
                            margin-right: 10px;
                        }
                    }
                }
            }


        }
    }

    @media (min-width: 992px) and (max-width: 1199.9px) {
        main {
            main {
                header {
                    @include header-lg;
                }
            }
        }
    }

    @media (min-width: 768px) and (max-width: 991.9px) {
        main {
            header {
                @include header-md;
            }

            .body.container {
                margin: 30px auto;
            }
        }
    }

    @media (min-width: 576px) and (max-width: 767.9px) {
        main {
            header {
                @include header-sm;
                h1.container {
                    font-size: 3.5rem !important;
                    h2 {
                        font-size: 2.5rem !important;
                    }
                }
            }

            .body.container {
                margin: 30px auto;
                h3 {
                    font-size: 3rem;
                    margin-bottom: 30px;
                }
                h2 {
                    font-size: 3rem;
                    margin-bottom: 15px;
                }
            }
        }
    }

    @media (max-width: 575.9px) {
        main {
            header {
                @include header-xs;
            }

            .body.container {
                margin: 30px auto;
                h3 {
                    font-size: 2.5rem;
                    margin-bottom: 30px;
                }
                h2 {
                    font-size: 2.5rem;
                    margin-bottom: 15px;
                }
            }
        }
    }



</style>