<template>
<!--    <main>-->
    <main v-html="pageBody.body">
<!--        <div></div>-->

<!--        <header class="container-fluid">-->
<!--            <h1 class="text-center">ЮРИДИЧНА ІНФОРМАЦІЯ-->
<!--                <h2 class="text-center">Умови використання веб-сайту</h2>-->
<!--            </h1>-->
<!--        </header>-->

<!--        <div class="body container text-left">-->
<!--            <h3>На цій сторінці викладено умови та положення, що регламентують використання веб-сайту Toyota.ua підприємства з іноземними інвестиціями «Тойота-Україна» (ПІІ «Тойота-Україна»). Просимо вас уважно ознайомитися з ними. У випадку, якщо ви не згодні з цими умовами та положеннями, будь ласка, не користуйтеся нашим веб-сайтом. Якщо у вас виникли запитання, будь ласка, скористайтеся формою зворотного зв’язку.</h3>-->
<!--            <h3>Усі права зберігаються за правовласником.</h3>-->
<!--            <h3>© Toyota Motor Europe та ПІІ «Тойота-Україна»</h3>-->

<!--            <h4>Інформаційні матеріали</h4>-->
<!--            <div class="p">На веб-сайті Toyota.ua представлено інформацію про продукцію Toyota та спеціальні пропозиції. Продукція Toyota, опис якої розміщено на цьому сайті, постачається виключно на ринки країн Європи для продажу авторизованими дилерами Toyota, а спеціальні пропозиції, представлені на цьому сайті, діють виключно в офіційній дилерській мережі Toyota в Україні.</div>-->
<!--            <div class="p">Усі матеріали на цьому веб-сайті розміщено виключно з інформаційною метою. Така інформація не призначена для використання користувачами або бути такою інформацією, на яку можна покластися як на заміну інформації, наявної у офіційних дилерів Toyota.</div>-->
<!--            <div class="p">Нами було докладено всіх зусиль до подання точної інформації, але при цьому ми зберігаємо за собою право без попередження вносити зміни до технічних характеристик, складу обладнання та вилучати з асортименту певні позиції. Ця інформація не має трактуватися як безпомилкова, й як така не являє собою ні оферти на продаж конкретного транспортного засобу, ані переліку його технічних характеристик. За довідками про актуальні технічні характеристики та наявність просимо звертатися до місцевого центру Toyota. Усі права зберігаються за правовласником.</div>-->

<!--            <h4>Ціни на продукцію під торговою маркою Toyota</h4>-->
<!--            <div class="p">Інформація про ціни на продукцію під торговою маркою Toyota, розміщена на веб-сайті Toyota.ua виключно для ознайомлення. Ця інформація не має трактуватися як безпомилкова, й як така не являє собою ні оферти на продаж конкретного транспортного засобу, ані переліку його технічних характеристик. Придбання товарів під торговою маркою Toyota регламентується відповідними договорами купівлі-продажу. За довідками про актуальні технічні характеристики, ціни та наявність просимо звертатися до місцевого центру Toyota.</div>-->

<!--            <h4>Використання технології HTTP-Cookie</h4>-->
<!--            <div class="p">На веб-сайті Toyota.ua застосовано технологію HTTP-Cookie для відстеження маршрутів, якими користуються відвідувачі сайту Toyota.ua. Це необхідно для ведення обліку активності користувачів на сайті Toyota.ua та проведення робіт з оцінки його ефективності, його вдосконалення. За допомогою цієї технології облік інформації про окремих користувачів не ведеться, тому ніяка інформація про них зберігатися та використовуватися не буде. Доводимо до вашого відома, що функціонування цієї технології можна заблокувати або обмежити у параметрах веб-переглядача (браузера), за допомогою якого здійснюється перегляд сторінок на цьому сайті.</div>-->

<!--            <h4>Використання онлайн-конфігуратора автомобілів Toyota</h4>-->
<!--            <div class="p">Конфігуратор автомобілів Toyota призначений для надання користувачам інформації, що відображає специфікацію та вартість автомобілів, які їх зацікавили. Звертаємо вашу увагу на те, що на сайті не вказано ціни на додаткове обладнання (аксесуари) та вартість їхнього встановлення. Нами було докладено всіх зусиль до подання точної інформації, але при цьому ми зберігаємо за собою право без попередження вносити зміни до технічних характеристик, складу обладнання та вилучати з асортименту певні позиції. Ця інформація не має трактуватися як безпомилкова, й як така не являє собою ні оферти на продаж конкретного транспортного засобу, ані переліку його технічних характеристик.</div>-->
<!--            <div class="p">Зображення, що подано у конфігураторі автомобілів, можуть відрізнятися від реальних автомобілів за кольором та параметрами, включати додаткове обладнання, яке не входить до складу обладнання типової комплектації. За довідками про актуальні технічні характеристики, наявність і ціни просимо звертатися в місцевий центр Toyota.</div>-->
<!--            <div class="p">ПІІ «Тойота-Україна» зберігає за собою право періодично вносити зміни і доповнення до конфігуратора в залежності від необхідності.</div>-->

<!--            <h4>Персональні дані та відгуки користувачів</h4>-->
<!--            <div class="p">Будь-які персональні дані, надані користувачами у розпорядження ПІІ «Тойота-Україна» за допомогою веб-сайту Toyota.ua, використовуватимуться виключно для поліпшення якості послуг, що надаються ПІІ «Тойота-Україна» відвідувачам цього веб-сайту. ПІІ «Тойота-Україна» зробить все можливе для того, щоб гарантувати безпеку збору, передачі та зберігання персональних даних, як того вимагає характер таких даних та законодавчі акти, що регулюють захист персональних даних. Персональні дані користувачів не будуть передані в розпорядження третіх сторін (за винятком підприємств офіційної дилерської мережі Toyota) без згоди самих користувачів. За користувачами зберігається право доступу, уточнення, заборони використання своїх персональних даних.</div>-->
<!--            <div class="p">ПІІ «Тойота-Україна» визнає той факт, що Всесвітня мережа є засобом, яким користувачі можуть скористатися для подачі відгуків про продукцію під торговою маркою Toyota, обслуговування у салонах та на СТО офіційних дилерів, а також про цей веб-сайт. ПІІ «Тойота-Україна» зробить все можливе, щоб прийняти до уваги отримані відгуки, якщо це буде визнано доречним та корисним. ПІІ «Тойота-Україна» не несе відповідальності за такі дані та зберігає за собою право видаляти їх з бази даних цього веб-сайту у будь-який час без попередження.</div>-->

<!--            <h4>Інтелектуальна власність</h4>-->
<!--            <div class="p">Спосіб подання інформації та всі матеріали цього веб-сайту, включаючи програмний код та оформлення, захищені нормативними актами, що регулюють відносини у сфері інтелектуальної власності. Дозволяється використання даних, текстів, фотографій або графічних матеріалів, розміщених на цьому сайті в особистих, некомерційних цілях. Забороняється їх відтворювати, змінювати, передавати, ліцензувати та/або публікувати, повністю або частково, з будь-якою метою без отримання письмової згоди на це з боку ПІІ «Тойота-Україна».</div>-->

<!--            <h4>Обмеження використання зображень з офіційних сайтів Toyota</h4>-->
<!--            <div class="p">«Тойота Мотор Юроп» ("Toyota Motor Europe") визнає той факт, що Всесвітня мережа є засобом обміну інформацією, та дозволяє відтворення на інших веб-сайтах зображень з веб-сайтів Toyota лише у випадку позитивної відповіді на відповідний запит, зроблений за адресою cust. service@toyota-europe.com. Обов’язкові умови такі:</div>-->
<!--            <ul>-->
<!--                <li>веб-сайт носить некомерційний характер; </li>-->
<!--                <li>торгова марка Toyota та продукція Toyota висвітлюються на сайті у позитивному ключі; </li>-->
<!--                <li>веб-сайт не містить непристойних або незаконних матеріалів; </li>-->
<!--                <li>зображення залишаються недоторканими (відсутні додаткові текстові елементи поверх зображень, вони не використовуються у фотоколажі, кольорова гамма не коригувалася, зображення не перекручені і т. і.); </li>-->
<!--                <li>дозволяється відтворення зображень, на яких представлено виключно товари, виготовлені на підприємствах корпорації «Тойота», забороняється відтворення елементів макетів сторінок та графічного оформлення веб-сайтів Toyota; </li>-->
<!--                <li>відтворюється помірна кількість зображень, які відповідають специфіці веб-сайту фан-клубу; </li>-->
<!--                <li>правовласника вказано у такій формі: «Copyright © Toyota Motor Europe (TME)»; </li>-->
<!--                <li>за допомогою гіперпосилки у якості джерела вказана адреса веб-сайту Toyota, з якого було взято зображення; </li>-->
<!--                <li>використовуючи зображення на своїх сайтах фізичні особи та організації дають свою згоду на те, щоб з ними зв’язувалися представники TME з метою розміщення на сайті Toyota гіперпосилок на їхні сайти.</li>-->
<!--            </ul>-->

<!--            <h4>Торговельні марки</h4>-->
<!--            <div class="p">Усі торговельні марки, логотипи та знаки обслуговування, розміщені на цьому веб-сайті, належать «Тойота Мотор Корпорейшн» (Toyota Motor Corporation of Japan), «Тойота Мотор Юроп» (Toyota Motor Europe, TME), підприємству з іноземними інвестиціями «Тойота-Україна» або третім сторонам. Забороняється будь-яке їхнє використання, завантаження для постійного зберігання, копіювання або розповсюдження без отримання письмової згоди на це з боку «Тойота Мотор Корпорейшн», «Тойота Мотор Юроп», ПІІ «Тойота-Україна» або третіх сторін відповідно.</div>-->

<!--            <h4>Гіперпосилання</h4>-->
<!--            <div class="p">На веб-сайті Toyota.ua можуть зустрічатися гіпертекстові посилки на інші веб-сайти, які абсолютно незалежні від цього сайту. ПІІ «Тойота-Україна» не несе відповідальності за точність, повноту або достовірність інформації, що міститься в таких гіпертекстових посилках або на інших веб-сайтах. Відвідування веб-сайтів, на які ведуть посилки з сайту Toyota.ua, здійснюється на розсуд самих користувачів.</div>-->

<!--            <h4>Обмеження відповідальності</h4>-->
<!--            <div class="p">ПІІ «Тойота-Україна» було докладено всіх зусиль до подання точної, достовірної, актуальної інформації на цьому веб-сайті, проте при цьому гарантія точності такої інформації не надається. ПІІ «Тойота-Україна» не несе відповідальності за точність, повноту або достовірність будь-якої інформації, розміщеної на цьому веб-сайті. Веб-сайт Toyota.ua та вся інформація й матеріали, розміщені на ньому, надаються користувачам у тому вигляді, в якому вони є, без будь-яких гарантій чи застережень, явних або не явних. У випадку, якщо ПІІ «Тойота-Україна» буде поінформовано про неточності в матеріалах, розміщених на цьому веб-сайті, буде докладено всіх зусиль для того, щоб їх виправити, щойно це стане можливо.</div>-->
<!--            <div class="p">ПІІ «Тойота-Україна» знімає з себе будь-яку відповідальність за прямі, непрямі, випадкові або інші збитки, які можуть бути викликані унаслідок відвідування або використання веб-сайту Toyota.ua, включаючи, але не обмежуючись, будь-які втрати чи збитки, які можуть бути викликані вірусними програмами, що вразили комп’ютери користувачів, або виникли внаслідок їхньої довіри до інформації, отриманої на веб-сайті Toyota.ua.  Зазначені на веб-сайті назви комплектацій є суто умовними та використовуються виключно заради зручності в розподілі наборів параметрів автомобіля.  Такі назви можуть відрізнятися або бути відсутніми в інших документах або матеріалах, які стосуються автомобіля, що жодним чином не впливає на повноту, точність чи достовірність поданої інформації</div>-->

<!--            <h4>Внесення змін</h4>-->
<!--            <div class="p">ПІІ «Тойота-Україна» зберігає за собою право періодично вносити зміни та доповнення до цих умов та положень залежно від необхідності. Просимо вас час від часу відвідувати цю сторінку для відстеження змін.</div>-->
<!--        </div>-->
    </main>
</template>

<script>
    import PageBody from "../../mixins/mixinPages"
    export default {
        name: "LegalInformation",

        mixins: [
            PageBody
        ],

        data() {
            return {
                id: 44,
            }
        },

        metaInfo() {
            return {
                title:  `Toyota Nikolaev | Юридична інформація`,
                meta: [
                    {
                        vmid: "title",
                        property: "og:title",
                        content: `Toyota Nikolaev | Юридична інформація`
                    },
                    {
                        vmid: "description",
                        name: "description",
                        content: `На цій сторінці викладено умови та положення, що регламентують використання веб-сайту підприємства з іноземними інвестиціями «Тойота-Україна».`
                    },
                    {
                        vmid: "description",
                        property: "og:description",
                        content: `На цій сторінці викладено умови та положення, що регламентують використання веб-сайту підприємства з іноземними інвестиціями «Тойота-Україна».`
                    },
                    {
                        vmid: "keywords",
                        name: "keywords",
                        content: `правила, сайт, веб-сайт, використання, тойота, тойота-україна, зображення, ціни, фотографії, продукція, тойота, toyota, тойота-україни, інтелектуальна власність, юридична інформація, cookie`
                    },
                    {
                        vmid: "keywords",
                        property: "og:keywords",
                        content: `правила, сайт, веб-сайт, використання, тойота, тойота-україна, зображення, ціни, фотографії, продукція, тойота, toyota, тойота-україни, інтелектуальна власність, юридична інформація, cookie`
                    },
                ],
            }
        },

        created() {
            this.getPageBody(this.id);
        },

        mounted() {
            // this.changeBody();
        },
    }
</script>

<style lang="scss" scoped>
    @import '../../styles/variables';

    * {
        margin: 0;
        /*padding: 0;*/
        color: $font_color;
    }
    
    main {
        header.container-fluid {
            @include header-xl;
            background-image: url(//t1-cms-4.images.toyota-europe.com/toyotaone/uaua/toyota-rav4-hybrid-logo-1600x900_tcm-3046-1092790.jpg);
            h1 {
                color: #FFFFFF;
                h2 {
                    color: #FFFFFF;
                }
            }
        }

        .body.container {
            margin: 68px auto;
            h3 {
                font-size: 2.2rem;
                font-weight: bolder;
                margin-bottom: 24px;
                text-align: center;
            }

            h4 {
                font-size: 1.8rem;
                font-weight: bold;
                margin: 60px 0 30px;
            }

            .p {
                font-size: 1.4rem;
                color: #595D60;
                margin-bottom: 30px;
            }

            ul {
                margin-left: 20px;
                font-size: 1.4rem;
                padding: 0;
                li {
                    color: #595D60;
                    margin-bottom: 10px;
                }
            }
        }
    }

    @media (min-width: 992px) and (max-width: 1199.9px) {
        main {
            header.container-fluid {
                @include header-lg;
            }
        }
    }

    @media (min-width: 768px) and (max-width: 991.9px) {
        main {
            header.container-fluid {
                @include header-md;
            }
        }
    }

    @media (min-width: 576px) and (max-width: 767.9px) {
        main {
            header.container-fluid {
                @include header-sm;
            }

            .body.container {
                margin: 30px auto;
                h3 {
                    font-size: 1.8rem;
                }

                h4 {
                    font-size: 1.6rem;
                    margin: 40px 0 20px;
                }

                p {
                    margin-bottom: 20px;
                }
            }
        }
    }

    @media (max-width: 575.9px) {
        main {
            header.container-fluid {
                @include header-xs;
            }

            .body.container {
                margin: 30px auto;
                h3 {
                    font-size: 1.8rem;
                }

                h4 {
                    font-size: 1.6rem;
                    margin: 30px 0 15px;
                }

                p {
                    margin-bottom: 15px;
                }
            }
        }
    }

</style>