<template>
    <main class="insurance container-fluid">
        <sidebar></sidebar>

        <section>
            <header>
                <h1>Тойота Страхование</h1>
                <h2>Оперативное урегулирование убытков</h2>
            </header>

            <div class="body">
                <h3>В официальной дилерской сети ПИИ «Тойота-Украина» действует страховая программа под названием «Тойота Страхование». Она направлена на качественное и оперативное урегулирование убытков при наступлении страховых случаев и позволит вам обезопасить свой автомобиль на выгодных условиях.</h3>

                <p>Страхование по программе «Тойота Страхование» осуществляет СК <a href="https://arx.com.ua/">«Страховая компания« ARX »</a>,« * (лицензия Госфинуслуг серия АВ № 483293 от 17.09.2009, лицензия Госфинуслуг серия АГ № 569137 от 25.11.2010).</p>
                <p>Страховой продукт «Тойота Страхование» доступен для владельцев автомобилей марки Toyota, приобретенных у официального дилера. Его целью является обеспечить <strong>удобство, качество, скорость и индивидуальный подход</strong> к каждому клиенту.</p>
                <p>Главными характеристиками программы «Тойота Страхование» являются прозрачные, доступные и выгодные условия страхования для всех клиентов, которые покупают автомобили Toyota в официальной дилерской сети ПИИ «Тойота-Украина».</p>
                
                <h3 class="text-left">Программа «Тойота Страхование» дает клиенту:</h3>
                <ul>
                    <li>возможность выбора одного из трех видов франшизы;</li>
                    <li>отсутствие ограничений по водительскому стажу при выборе вида франшизи.</li>
                </ul>

                <p>При наступлении страхового случая ремонт автомобиля может быть осуществлен на сервисных станциях официальных дилерских центров Toyota со строгим соблюдением нормативов фирмы-производителя по ремонту и использованием только оригинальных запасных частей. Приведенное позволяет обеспечить достойное качество ремонтных работ и высокую остаточную стоимость автомобиля в процессе его эксплуатации.</p>
                <p>Владелец автомобиля Toyota имеет возможность заключить договор страхования КАСКО и приобрести полис обязательного страхования гражданской ответственности владельцев автомобилей в любом автосалоне официального дилера Toyota в рамках программы «Тойота Страхование».</p>

                <h3 class="text-left">Для того, чтобы заключить договор страхования необходимо предоставить минимальный комплект документов:</h3>

                <ul>
                    <li>свидетельство о регистрации ТС (техпаспорт) или справку-счет на автомобиль;</li>
                    <li>водительское удостоверение;</li>
                    <li>гражданский паспорт и идентификационный код.</li>
                </ul>

                <p>Процедура оформления приятно удивит вас оперативностью.</p>
                <p>Страховые агенты выполнят все необходимые формальности и сделают процесс оформления договора максимально быстрым и приятным.</p>
                <p>Подробнее о страховой программе «Тойота Страхование», представленной «Страховая компания« ARX »*, можно узнать в салонах официальных дилеров Toyota в Украине.</p>

                <em>*До 21 июня 2019 року - «AXA Страхування»</em>
                
            </div>

            
        </section>
    </main>
</template>

<script>
    import Sidebar from "@/components/permanent/Sidebar";

    export default {
        name: "Insurance",

        components: {
            Sidebar
        }
    }
</script>

<style lang="scss" scoped>
    @import '../../styles/variables';
    
    main.container-fluid {
        margin: 0;
        padding: 0;
        section {
            header {
                margin: 0;
                width: 100%;
                height: 80vh;
                padding: 70px 15px 20px;

                background-image: url('//t1-cms-1.images.toyota-europe.com/toyotaone/uaua/insurance-header_tcm-3046-165896.jpg');
                background-repeat: no-repeat;
                -webkit-background-size: cover;
                background-size: cover;
                background-position: center center;
                color: #ffffff;
                h1 {
                    font-size: 4.4rem;
                    font-weight: bolder;
                    padding-bottom: 16px;
                }
                h2 {
                    font-size: 3.4rem;
                    font-weight: bold;
                }
            }
            .body {
                padding: 68px 15px;
                text-align: left;
                color: #595D60;
                h3 {
                    font-size: 1.8rem;
                    font-weight: bold;
                    margin-bottom: 40px;
                    text-align: center;
                    color: $font_color;
                }
                p {
                    margin-bottom: 40px;
                    font-size: 1.6rem;
                    a {
                        color: #595D60;
                        text-decoration: underline;
                    }
                }

                ul {
                    padding: 0 0 10px 20px;
                    li{
                        font-size: 1.6rem;
                        margin-bottom: 10px;
                    }
                }

                em {
                    font-size: 1.6rem;
                }
            }
        }
    }

</style>