<template>
    <main class="container">
        <div v-html="pageBody"></div>
<!--        <header>-->
<!--            <h1>Політика соціальної корпоративної відповідальності</h1>-->
<!--            <h2>Відповідальність перед суспільством</h2>-->
<!--        </header>-->

<!--        <div class="body text-left">-->
<!--            <h3>Національна компанія з маркетингу та продажу автомобілів, запасних частин і аксесуарів Toyota та Lexus на території України і Молдови ПІІ «Тойота-Україна» подібно всім підприємствам, що входять до групи компаній «Тойота», при здійсненні своєї діяльності керується принципами політики корпоративної соціальної відповідальності.</h3>-->

<!--            <div class="info">-->
<!--                <p>«Тойота» повністю усвідомлює свою відповідальність перед суспільством. При визначенні стратегії свого розвитку і у поточній діяльності компанія виходить з того, що обов’язковою умовою сталого розвитку бізнесу є неухильне дотримання принципів соціальної відповідальності. Відповідно з такими принципами вона бачить свої завдання не лише у виробництві необхідної для суспільства продукції, а й у сприянні соціальному прогресу, зростанню добробуту суспільства в цілому та підвищенні рівня життя своїх співробітників зокрема.</p>-->
<!--                <p>Компанія прагне здійснювати свою виробничу діяльність у суворій відповідності до вимог не лише законодавства у сфері екології та природокористування, але й власної екологічної політики, а також відповідно до «Екологічної хартії Toyota».</p>-->
<!--                <p>На практиці це означає, що кожен співробітник в офісі або на виробництві прагне дбайливо ставитися до природних ресурсів, а саме заощаджувати електроенергію і воду, раціонально витрачати папір, намагаючись в більшій мірі використовувати електронні багаторазові носії.</p>-->
<!--                <p>Взаємини керівництва і співробітників компанії будуються на принципах соціального партнерства. «Тойота» забезпечує співробітникам конкурентоспроможний рівень винагороди. </p>-->
<!--                <p>Особливу увагу «Тойота» приділяє професійному росту співробітників. На постійній основі діють програми навчання та підвищення кваліфікації.</p>-->
<!--                <p>«Тойота» веде активну благодійну та спонсорську діяльність як самостійно, так і в партнерстві з громадськими та державними організаціями, залучаючи своїх співробітників до участі в суспільно-ефективних проектах у соціальній та природоохоронній сферах.</p>-->
<!--                <p>У рамках реалізованої політики соціальної відповідальності «Тойота» сприяє розвитку культури, спорту та освіти.</p>-->
<!--                <p>Особливу увагу в компанії приділяють програмам, пов’язаним з безпекою на автомобільних шляхах. Зокрема, «Тойота» веде постійну пропаганду використання ременів безпеки. На тверде переконання експертів, саме цей нескладний пристрій допоміг врятувати життя мільйонам автомобілістів в аварійних ситуаціях на дорозі.</p>-->
<!--            </div>-->
<!--        </div>-->
    </main>
</template>

<script>
    import PageBody from "../../mixins/mixinPages"
    export default {
        name: "CorporateResponsibility",

        mixins: [
            PageBody
        ],

        data() {
            return {
                id: 39,
            }
        },


        metaInfo() {
            return {
                // title:  `Toyota Nikolaev | Соціальної відповідальності Toyota Україна`,
                title: `Toyota Nikolaev | ${this.pageTitle}`,
                meta: [
                    {
                        vmid: "title",
                        property: "og:title",
                        // content: `Toyota Nikolaev | Соціальної відповідальності Toyota Україна`
                        content: `Toyota Nikolaev | ${this.pageTitle}`
                    },
                    {
                        vmid: "description",
                        name: "description",
                        // content: `Тойота Центр Миколаїв «КіТ-Т» при здійсненні діяльності керується принципами політики корпоративної соціальної відповідальності.`
                        content: this.meta_description,
                    },
                    {
                        vmid: "description",
                        property: "og:description",
                        // content: `Тойота Центр Миколаїв «КіТ-Т» при здійсненні діяльності керується принципами політики корпоративної соціальної відповідальності.`
                        content: this.meta_description,
                    },
                    {
                        vmid: "keywords",
                        name: "keywords",
                        // content: `Toyota Nikolaev, Toyota, тойота, соціальна відповідальність, екологія, принцип, політика, тойота, Україна`
                        content: this.meta_keywords,
                    },
                    {
                        vmid: "keywords",
                        property: "og:keywords",
                        // content: `Toyota Nikolaev, Toyota, тойота, соціальна відповідальність, екологія, принцип, політика, тойота, Україна`
                        content: this.meta_keywords,
                    },
                ],
            }
        },

        // mounted() {
        //     setTimeout(() => {this.$store.commit("setShowPreload", false);}, 1500)
        // },
    }
</script>

<style lang="scss" scoped>
    @import '../../styles/variables';

    * {
        margin: 0;
        padding: 0;
        color: $font_color;
    }

    main.container ::v-deep div {
        margin: auto;
        header {
            text-align: center;
            margin: 68px 0;
            h1 {
                font-size: 5.2rem;
                font-weight: bolder;
                margin-bottom: 20px;
            }
            h2 {
                font-size: 3.5rem;
                font-weight: bold;
            }
        }

        .body {
            h3 {
                font-size: 2.5rem;
                text-align: center;
                margin-bottom: 68px;
            }
            .info {
                column-count: 2;
                column-gap: 30px;
                height: auto;
                .p {
                    font-size: 1.6rem;
                    color: #595D60;
                    margin-bottom: 24px;
                }
            }
        }
    }

    @media (min-width: 576px) and (max-width: 991.9px) {
        main.container ::v-deep div {
            header {
                margin: 30px 0;
                h1 {
                    font-size: 3.5rem;
                    margin-bottom: 10px;
                }
                h2 {
                    font-size: 2.4rem;
                }
            }

            .body {
                h3 {
                    font-size: 2.5rem;
                }
                .info {
                    column-count: 1;
                }
            }
        }
    }

    @media (max-width: 575.9px) {
        main.container ::v-deep div {
            padding: 0 15px;
            header {
                margin: 30px 0;
                h1 {
                    font-size: 3.5rem;
                    margin-bottom: 10px;
                }
                h2 {
                    font-size: 2.5rem;
                }
            }
            .body {
                h3 {
                    font-size: 2.5rem;
                    margin-bottom: 30px;
                }
                .info {
                    column-count: 1;
                }
            }
        }
    }

</style>